import pytest
"""
*-----------------------*---------------------------------------*
|   Ограничение времени |   1 секунда                           |
|   Ограничение памяти  |   64Mb                                |
|   Ввод                |   стандартный ввод или input.txt      |
|   Вывод               |   стандартный вывод или output.txt    |
*-----------------------*---------------------------------------*

Дана геометрическая прогрессия, n-ый член которой задается формулой bn=b1⋅qn−1, где b1 - первый член геометрической прогрессии, q - знаменатель прогрессии. 
Найти сумму первых N членов геометрической прогрессии
"""

def test_example():
    assert sequenceSum(1,2,3) == 7.000


def sequenceSum(
    b_1: float,
    q: float, 
    N: float
)-> float:
    return b_1 * (1-q**N)/(1-q)


def main() -> None:
    b_1, q, N = map(float, input().split())
    print(f"{sequenceSum(b_1, q, N):.3f}")



if __name__ == "__main__":
    main()
